KingKoro/CH32VX-GPIO-EXTI-PIO-Library/lib/CH32V_GPIO/ch32v_gpio.c
/**
 *  CH32VX GPIO Library
 *
 *  file         : ch32v_gpio.c
 *  description  : ch32v gpio library main code
 *  Created on: Jan 12, 2023
 *  Author: larry
 *  https://github.com/bitbank2/CH32V_Experiments/tree/master
 *
 */

#include "ch32v_gpio.h"

// Function pointer for EXTI ISR function body, placeholder declaration
void (*f_body_exti0)(void);
void (*f_body_exti1)(void);
void (*f_body_exti2)(void);
void (*f_body_exti3)(void);
void (*f_body_exti4)(void);
void (*f_body_exti5)(void);
void (*f_body_exti6)(void);
void (*f_body_exti7)(void);
void (*f_body_exti8)(void);
void (*f_body_exti9)(void);
void (*f_body_exti10)(void);
void (*f_body_exti11)(void);
void (*f_body_exti12)(void);
void (*f_body_exti13)(void);
void (*f_body_exti14)(void);
void (*f_body_exti15)(void);
// EXTI ISR, placeholder declaration
void EXTI0_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void EXTI1_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void EXTI2_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void EXTI3_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void EXTI4_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void EXTI9_5_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void EXTI15_10_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));

#ifdef BITBANG
uint8_t u8SDA_Pin, u8SCL_Pin;
int iDelay = 1;
#endif

void delay(int i)
{
	Delay_Ms(i);
}

// Arduino-like API defines and function wrappers for WCH MCUs

/*********************************************************************
 * @fn      pinMode
 *
 * @brief   Set pin mode, analog to Arduino API.
 * 
 * @param   u8Pin           Pin number with 2 x nibble numbering scheme (e.g 0xC7 = Pin C7)
 * @param   iMode           Pin Mode (can be either OUTPUT, INPUT, INPUT_PULLUP or INPUT_PULLDOWN)
 * 
 * @return  None
 */
void pinMode(uint8_t u8Pin, int iMode)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    if (u8Pin < 0xa0 || u8Pin > 0xdf) return; // invalid pin number

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 << (u8Pin & 0xf);
    if (iMode == OUTPUT)
    	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    else if (iMode == INPUT)
    	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    else if (iMode == INPUT_PULLUP)
    	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    else if (iMode == INPUT_PULLDOWN)
    	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    switch (u8Pin & 0xf0) {
    case 0xa0:
    	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
        GPIO_Init(GPIOA, &GPIO_InitStructure);
    	break;
    case 0xb0:
    	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
        GPIO_Init(GPIOB, &GPIO_InitStructure);
    	break;
    case 0xc0:
    	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
        GPIO_Init(GPIOC, &GPIO_InitStructure);
    	break;
    case 0xd0:
    	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD, ENABLE);
        GPIO_Init(GPIOD, &GPIO_InitStructure);
    	break;
    }
} /* pinMode() */

/*********************************************************************
 * @fn      digitalRead
 *
 * @brief   Digital Read analog to Arduino API.
 * 
 * @param   u8Pin           Pin number with 2 x nibble numbering scheme (e.g 0xC7 = Pin C7)
 * 
 * @return  Binary value on digital input pin. 1 or 0
 */
uint8_t digitalRead(uint8_t u8Pin)
{
    uint32_t u32GPIO = GPIO_Pin_0 << (u8Pin & 0xf);
    uint8_t u8Value = 0;
    switch (u8Pin & 0xf0) {
    case 0xa0:
    	u8Value = GPIO_ReadInputDataBit(GPIOA, u32GPIO);
    	break;
    case 0xb0:
    	u8Value = GPIO_ReadInputDataBit(GPIOB, u32GPIO);
    	break;
    case 0xc0:
    	u8Value = GPIO_ReadInputDataBit(GPIOC, u32GPIO);
    	break;
    case 0xd0:
    	u8Value = GPIO_ReadInputDataBit(GPIOD, u32GPIO);
    	break;
    }
    return u8Value;
} /* digitalRead() */

/*********************************************************************
 * @fn      digitalWrite
 *
 * @brief   Digital Write analog to Arduino API.
 * 
 * @param   u8Pin           Pin number with 2 x nibble numbering scheme (e.g 0xC7 = Pin C7)
 * @param   u8Value         New value for digital output. Either Bit_SET or Bit_RESET (1 or 0). See @ref BitAction
 * 
 * @return  none
 */
void digitalWrite(uint8_t u8Pin, uint8_t u8Value)
{
	uint32_t u32GPIO = GPIO_Pin_0 << (u8Pin & 0xf);
	u8Value = (u8Value) ? Bit_SET : Bit_RESET;

	switch (u8Pin & 0xf0) {
	case 0xa0:
		GPIO_WriteBit(GPIOA, u32GPIO, u8Value);
		break;
	case 0xb0:
		GPIO_WriteBit(GPIOB, u32GPIO, u8Value);
		break;
	case 0xc0:
		GPIO_WriteBit(GPIOC, u32GPIO, u8Value);
		break;
	case 0xd0:
		GPIO_WriteBit(GPIOD, u32GPIO, u8Value);
		break;
	}
} /* digitalWrite() */

// TODO: Debounce example with button + LED + sysclock to detect bouncing
// TODO: EXTI function for other types of external interrupt (pvd, rtc, ...)
/*********************************************************************
 * @fn      pinInterrupt
 *
 * @brief   This function initializes the interrupt generation for external events on GPIO Pins.
 * 
 * @param   u8Pin           Pin number with 2 x nibble numbering scheme (e.g 0xC7 = Pin C7)
 * @param   iMode           Pin Mode (can be either INPUT, INPUT_PULLUP or INPUT_PULLDOWN)
 * @param   NewState        New state for interrupt generation after function call (either ENABLE or DISABLE) see @ref FunctionalState
 * @param   TriggerType     Trigger type (either EXTI_Trigger_Rising, EXTI_Trigger_Falling or EXTI_Trigger_Rising_Falling) see @ref EXTITrigger_TypeDef
 * @param   func            Pointer to function which shall be called upon interrupt, must be return type void and parameter void. Declare or define before passing it here as function name.
 * 
 * @return  none
 */
void pinInterrupt(uint8_t u8Pin, int iMode, FunctionalState NewState, EXTITrigger_TypeDef TriggerType, void (*func)(void))
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    EXTI_InitTypeDef EXTI_InitStructure = {0};
    NVIC_InitTypeDef NVIC_InitStructure = {0};

    if (u8Pin < 0xa0 || u8Pin > 0xdf) return; // invalid pin number
    // Get Pin number GPIO_Pin_X
    uint32_t u32GPIO = GPIO_Pin_0 << (u8Pin & 0xf);     // GPIO_Pin_X = EXTI_LineX
    // Convert GPIO_Pin_X to GPIO_PinSourceX
    uint32_t u32GPIO_temp = u32GPIO;
    uint8_t u8GPIO = 0;                                 // GPIO_PinSourceX
    while (u32GPIO_temp >>= 1) u8GPIO++;
    // Set pin to input
    GPIO_InitStructure.GPIO_Pin = u32GPIO;
    if (iMode == OUTPUT)
    	return; // invalid pin mode for interrupt
    else if (iMode == INPUT)
    	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    else if (iMode == INPUT_PULLUP)
    	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    else if (iMode == INPUT_PULLDOWN)
    	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
    // Port-specific enable
    switch (u8Pin & 0xf0) 
    {
        case 0xa0:
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOA, ENABLE);
            GPIO_Init(GPIOA, &GPIO_InitStructure);
            GPIO_EXTILineConfig(GPIO_PortSourceGPIOA, u8GPIO);
            break;
        case 0xb0:
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOB, ENABLE);
            GPIO_Init(GPIOB, &GPIO_InitStructure);
            GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, u8GPIO);
            break;
        case 0xc0:
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOC, ENABLE);
            GPIO_Init(GPIOC, &GPIO_InitStructure);
            GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, u8GPIO);
            break;
        case 0xd0:
            RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOD, ENABLE);
            GPIO_Init(GPIOD, &GPIO_InitStructure);
            GPIO_EXTILineConfig(GPIO_PortSourceGPIOD, u8GPIO);
            break;
    }
    // Configure EXTI Structure
    EXTI_InitStructure.EXTI_Line = u32GPIO;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = TriggerType;
    EXTI_InitStructure.EXTI_LineCmd = NewState;
    EXTI_Init(&EXTI_InitStructure);
    // Configure NVIC Structure
    if (u8GPIO == GPIO_PinSource0) NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
    else if (u8GPIO == GPIO_PinSource1) { NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;   f_body_exti1 = func; }
    else if (u8GPIO == GPIO_PinSource2) NVIC_InitStructure.NVIC_IRQChannel = EXTI2_IRQn;
    else if (u8GPIO == GPIO_PinSource3) NVIC_InitStructure.NVIC_IRQChannel = EXTI3_IRQn;
    else if (u8GPIO == GPIO_PinSource4) NVIC_InitStructure.NVIC_IRQChannel = EXTI4_IRQn;
    else if (u8GPIO >= GPIO_PinSource5 && u8GPIO <= GPIO_PinSource9) NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn;
    else if (u8GPIO >= GPIO_PinSource10 && u8GPIO <= GPIO_PinSource15) NVIC_InitStructure.NVIC_IRQChannel = EXTI15_10_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd = NewState;
    NVIC_Init(&NVIC_InitStructure);
}

/*********************************************************************
 * @fn      EXTI0_IRQHandler
 *
 * @brief   This function handles EXTI0 ISR.
 *
 * @return  none
 */
void EXTI0_IRQHandler(void)
{
    if(EXTI_GetITStatus(EXTI_Line0)!=RESET)
    {
        (*f_body_exti0)();
        EXTI_ClearITPendingBit(EXTI_Line0);     /* Clear Flag */
    }
}

/*********************************************************************
 * @fn      EXTI1_IRQHandler
 *
 * @brief   This function handles EXTI1 ISR.
 *
 * @return  none
 */
void EXTI1_IRQHandler(void)
{
    if(EXTI_GetITStatus(EXTI_Line1)!=RESET)
    {
        (*f_body_exti1)();
        EXTI_ClearITPendingBit(EXTI_Line1);     /* Clear Flag */
    }
}

/*********************************************************************
 * @fn      EXTI2_IRQHandler
 *
 * @brief   This function handles EXTI2 ISR.
 *
 * @return  none
 */
void EXTI2_IRQHandler(void)
{
    if(EXTI_GetITStatus(EXTI_Line2)!=RESET)
    {
        (*f_body_exti2)();
        EXTI_ClearITPendingBit(EXTI_Line2);     /* Clear Flag */
    }
}

/*********************************************************************
 * @fn      EXTI3_IRQHandler
 *
 * @brief   This function handles EXTI3 ISR.
 *
 * @return  none
 */
void EXTI3_IRQHandler(void)
{
    if(EXTI_GetITStatus(EXTI_Line3)!=RESET)
    {
        (*f_body_exti3)();
        EXTI_ClearITPendingBit(EXTI_Line3);     /* Clear Flag */
    }
}

/*********************************************************************
 * @fn      EXTI4_IRQHandler
 *
 * @brief   This function handles EXTI4 ISR.
 *
 * @return  none
 */
void EXTI4_IRQHandler(void)
{
    if(EXTI_GetITStatus(EXTI_Line4)!=RESET)
    {
        (*f_body_exti4)();
        EXTI_ClearITPendingBit(EXTI_Line4);     /* Clear Flag */
    }
}

/*********************************************************************
 * @fn      EXTI9_5_IRQHandler
 *
 * @brief   This function handles EXTI9_5 ISR.
 *
 * @return  none
 */
void EXTI9_5_IRQHandler(void)
{
    if(EXTI_GetITStatus(EXTI_Line5)!=RESET)
    {
        (*f_body_exti5)();
        EXTI_ClearITPendingBit(EXTI_Line5);     /* Clear Flag */
    }
    else if(EXTI_GetITStatus(EXTI_Line6)!=RESET)
    {
        (*f_body_exti6)();
        EXTI_ClearITPendingBit(EXTI_Line6);     /* Clear Flag */
    }
    else if(EXTI_GetITStatus(EXTI_Line7)!=RESET)
    {
        (*f_body_exti7)();
        EXTI_ClearITPendingBit(EXTI_Line7);     /* Clear Flag */
    }
    else if(EXTI_GetITStatus(EXTI_Line8)!=RESET)
    {
        (*f_body_exti8)();
        EXTI_ClearITPendingBit(EXTI_Line8);     /* Clear Flag */
    }
    else if(EXTI_GetITStatus(EXTI_Line9)!=RESET)
    {
        (*f_body_exti9)();
        EXTI_ClearITPendingBit(EXTI_Line9);     /* Clear Flag */
    }
}

/*********************************************************************
 * @fn      EXTI15_10_IRQHandler
 *
 * @brief   This function handles EXTI15_10 ISR.
 *
 * @return  none
 */
void EXTI15_10_IRQHandler(void)
{
    if(EXTI_GetITStatus(EXTI_Line10)!=RESET)
    {
        (*f_body_exti10)();
        EXTI_ClearITPendingBit(EXTI_Line10);     /* Clear Flag */
    }
    else if(EXTI_GetITStatus(EXTI_Line11)!=RESET)
    {
        (*f_body_exti11)();
        EXTI_ClearITPendingBit(EXTI_Line11);     /* Clear Flag */
    }
    else if(EXTI_GetITStatus(EXTI_Line12)!=RESET)
    {
        (*f_body_exti12)();
        EXTI_ClearITPendingBit(EXTI_Line12);     /* Clear Flag */
    }
    else if(EXTI_GetITStatus(EXTI_Line13)!=RESET)
    {
        (*f_body_exti13)();
        EXTI_ClearITPendingBit(EXTI_Line13);     /* Clear Flag */
    }
    else if(EXTI_GetITStatus(EXTI_Line14)!=RESET)
    {
        (*f_body_exti14)();
        EXTI_ClearITPendingBit(EXTI_Line14);     /* Clear Flag */
    }
    else if(EXTI_GetITStatus(EXTI_Line15)!=RESET)
    {
        (*f_body_exti15)();
        EXTI_ClearITPendingBit(EXTI_Line15);     /* Clear Flag */
    }
}

#ifdef BITBANG
uint8_t SDA_READ(void)
{
	return digitalRead(u8SDA_Pin);
}
void SDA_HIGH(void)
{
	pinMode(u8SDA_Pin, INPUT);
}
void SDA_LOW(void)
{
	pinMode(u8SDA_Pin, OUTPUT);
	digitalWrite(u8SDA_Pin, 0);
}
void SCL_HIGH(void)
{
	pinMode(u8SCL_Pin, INPUT);
}
void SCL_LOW(void)
{
	pinMode(u8SCL_Pin, OUTPUT);
	digitalWrite(u8SCL_Pin, 0);
}
void I2CSetSpeed(int iSpeed)
{
	if (iSpeed >= 400000) iDelay = 1;
	else if (iSpeed >= 100000) iDelay = 10;
	else iDelay = 20;
}
void I2CInit(uint8_t u8SDA, uint8_t u8SCL, int iSpeed)
{
	u8SDA_Pin = u8SDA;
	u8SCL_Pin = u8SCL;
	if (iSpeed >= 400000) iDelay = 1;
	else if (iSpeed >= 100000) iDelay = 10;
	else iDelay = 20;
} /* I2CInit() */

void my_sleep_us(int iDelay)
{
	Delay_Us(iDelay);
}
// Transmit a byte and read the ack bit
// if we get a NACK (negative acknowledge) return 0
// otherwise return 1 for success
//

